{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 1, 32, 32], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "config": {"W_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "dropout_1", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2", "config": {"W_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3", "config": {"W_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "dropout_2", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_4", "config": {"W_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_5", "config": {"W_regularizer": null, "name": "convolution2d_5", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 128, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "dropout_3", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_6", "config": {"W_regularizer": null, "name": "convolution2d_6", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 128, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "upsampling2d_1", "config": {"name": "upsampling2d_1", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "name": "merge_1", "config": {"name": "merge_1", "output_mask_type": "raw", "output_mask": null, "dot_axes": -1, "output_shape": null, "concat_axis": 1, "mode_type": "raw", "output_shape_type": "raw", "mode": "concat", "arguments": {}}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_7", "config": {"W_regularizer": null, "name": "convolution2d_7", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "dropout_4", "config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution2d_8", "config": {"W_regularizer": null, "name": "convolution2d_8", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "upsampling2d_2", "config": {"name": "upsampling2d_2", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "name": "merge_2", "config": {"name": "merge_2", "output_mask_type": "raw", "output_mask": null, "dot_axes": -1, "output_shape": null, "concat_axis": 1, "mode_type": "raw", "output_shape_type": "raw", "mode": "concat", "arguments": {}}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_9", "config": {"W_regularizer": null, "name": "convolution2d_9", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "dropout_5", "config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0]]], "name": "convolution2d_10", "config": {"W_regularizer": null, "name": "convolution2d_10", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 3, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "convolution2d_11", "config": {"W_regularizer": null, "name": "convolution2d_11", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "trainable": true, "nb_col": 1, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 5, "activity_regularizer": null, "nb_row": 1, "bias": true}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "reshape_1", "config": {"target_shape": [5, 1024], "name": "reshape_1", "trainable": true}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0]]], "name": "permute_1", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "class_name": "Permute"}, {"inbound_nodes": [[["permute_1", 0, 0]]], "name": "activation_1", "config": {"activation": "softplus", "name": "activation_1", "trainable": true}, "class_name": "Activation"}]}, "keras_version": "1.2.2"}