{"config": {"output_layers": [["activation_5", 0, 0]], "name": "model_1", "layers": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"name": "zeropadding2d_1", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_1"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "trainable": true, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1"}, {"config": {"axis": -1, "name": "batchnormalization_1", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_1"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_1"}, {"config": {"name": "zeropadding2d_2", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_2"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "trainable": true, "nb_filter": 128, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2"}, {"config": {"axis": -1, "name": "batchnormalization_2", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_2"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "class_name": "Activation", "name": "activation_2"}, {"config": {"strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_2"}, {"config": {"name": "zeropadding2d_3", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_3"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "trainable": true, "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3"}, {"config": {"axis": -1, "name": "batchnormalization_3", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_3"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "Activation", "name": "activation_3"}, {"config": {"strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_3"}, {"config": {"name": "zeropadding2d_4", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_4"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "trainable": true, "nb_filter": 512, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4"}, {"config": {"axis": -1, "name": "batchnormalization_4", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_4"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "class_name": "Activation", "name": "activation_4"}, {"config": {"name": "zeropadding2d_5", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_5"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "trainable": true, "nb_filter": 512, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5"}, {"config": {"axis": -1, "name": "batchnormalization_5", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_5"}, {"config": {"name": "upsampling2d_1", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "UpSampling2D", "name": "upsampling2d_1"}, {"config": {"name": "zeropadding2d_6", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_6"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_6", "border_mode": "valid", "trainable": true, "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_6", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_6"}, {"config": {"axis": -1, "name": "batchnormalization_6", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_6"}, {"config": {"name": "upsampling2d_2", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "class_name": "UpSampling2D", "name": "upsampling2d_2"}, {"config": {"name": "zeropadding2d_7", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_7"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_7", "border_mode": "valid", "trainable": true, "nb_filter": 128, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_7", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_7"}, {"config": {"axis": -1, "name": "batchnormalization_7", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_7"}, {"config": {"name": "upsampling2d_3", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "class_name": "UpSampling2D", "name": "upsampling2d_3"}, {"config": {"name": "zeropadding2d_8", "trainable": true, "padding": [1, 1]}, "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_8"}, {"config": {"activation": "linear", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_8", "border_mode": "valid", "trainable": true, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding2d_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_8"}, {"config": {"axis": -1, "name": "batchnormalization_8", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_8"}, {"config": {"activation": "linear", "bias": true, "nb_col": 1, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_9", "border_mode": "valid", "trainable": true, "nb_filter": 6, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "nb_row": 1, "dim_ordering": "th", "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_9"}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [6, 1024]}, "inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "Reshape", "name": "reshape_1"}, {"config": {"name": "permute_1", "dims": [2, 1], "trainable": true}, "inbound_nodes": [[["reshape_1", 0, 0]]], "class_name": "Permute", "name": "permute_1"}, {"config": {"activation": "softmax", "name": "activation_5", "trainable": true}, "inbound_nodes": [[["permute_1", 0, 0]]], "class_name": "Activation", "name": "activation_5"}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.2", "class_name": "Model"}