{"keras_version": "1.2.2", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 32, 32], "input_dtype": "float32", "name": "input_1", "sparse": false}}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_1", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "dropout_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_2", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}}, {"name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_3", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "dropout_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"name": "convolution2d_4", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_4", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}}, {"name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_5", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 128, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "dropout_3", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}}, {"name": "convolution2d_6", "inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_6", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 128, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "upsampling2d_1", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "UpSampling2D", "config": {"name": "upsampling2d_1", "size": [2, 2], "trainable": true}}, {"name": "merge_1", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "name": "merge_1", "output_mask": null, "output_shape": null, "concat_axis": 1, "output_mask_type": "raw", "mode": "concat"}}, {"name": "convolution2d_7", "inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_7", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "dropout_4", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.2, "trainable": true}}, {"name": "convolution2d_8", "inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_8", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "upsampling2d_2", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "UpSampling2D", "config": {"name": "upsampling2d_2", "size": [2, 2], "trainable": true}}, {"name": "merge_2", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "name": "merge_2", "output_mask": null, "output_shape": null, "concat_axis": 1, "output_mask_type": "raw", "mode": "concat"}}, {"name": "convolution2d_9", "inbound_nodes": [[["merge_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_9", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "dropout_5", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.2, "trainable": true}}, {"name": "convolution2d_10", "inbound_nodes": [[["dropout_5", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_10", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "convolution2d_11", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_row": 1, "bias": true, "W_constraint": null, "trainable": true, "name": "convolution2d_11", "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "nb_col": 1, "border_mode": "same", "b_constraint": null, "nb_filter": 6, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "th", "init": "glorot_uniform"}}, {"name": "reshape_1", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [6, 1024]}}, {"name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0]]], "class_name": "Permute", "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}}, {"name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "softplus", "trainable": true}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]]}}