{"keras_version": "1.2.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 1, 32, 32], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "convolution2d_1", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 32, "name": "convolution2d_1", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 32, "name": "convolution2d_2", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "maxpooling2d_1", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "name": "convolution2d_3", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "convolution2d_4", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "name": "convolution2d_4", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "maxpooling2d_2", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 128, "name": "convolution2d_5", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "convolution2d_6", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 128, "name": "convolution2d_6", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "upsampling2d_1", "config": {"name": "upsampling2d_1", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "merge_1", "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "concat", "name": "merge_1", "concat_axis": 1, "arguments": {}, "output_mask": null, "output_shape": null, "output_mask_type": "raw", "dot_axes": -1}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_7", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "name": "convolution2d_7", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "convolution2d_8", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "name": "convolution2d_8", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "upsampling2d_2", "config": {"name": "upsampling2d_2", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "merge_2", "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "concat", "name": "merge_2", "concat_axis": 1, "arguments": {}, "output_mask": null, "output_shape": null, "output_mask_type": "raw", "dot_axes": -1}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_9", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 32, "name": "convolution2d_9", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_10", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "nb_filter": 32, "name": "convolution2d_10", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "convolution2d_11", "config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_row": 1, "nb_filter": 6, "name": "convolution2d_11", "border_mode": "same", "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "trainable": true, "nb_col": 1, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [6, 1024]}, "class_name": "Reshape", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "permute_1", "config": {"dims": [2, 1], "name": "permute_1", "trainable": true}, "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "softplus"}, "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0]]]}], "output_layers": [["activation_1", 0, 0]]}, "class_name": "Model"}