{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 3, 288, 384], "input_dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 32, "name": "convolution2d_1", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 32, "name": "convolution2d_2", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 64, "name": "convolution2d_3", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 128, "name": "convolution2d_5", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 128, "name": "convolution2d_6", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_1", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_mask": null, "name": "merge_1", "arguments": {}, "output_mask_type": "raw", "output_shape": null, "mode": "concat", "concat_axis": 1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 64, "name": "convolution2d_7", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 64, "name": "convolution2d_8", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_2", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"output_mask": null, "name": "merge_2", "arguments": {}, "output_mask_type": "raw", "output_shape": null, "mode": "concat", "concat_axis": 1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 32, "name": "convolution2d_9", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "p": 0.2}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 32, "name": "convolution2d_10", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"init": "glorot_uniform", "nb_col": 1, "activity_regularizer": null, "bias": true, "dim_ordering": "th", "trainable": true, "nb_filter": 4, "name": "convolution2d_11", "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [4, 110592]}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Permute", "name": "permute_1", "config": {"trainable": true, "name": "permute_1", "dims": [2, 1]}, "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softplus"}, "inbound_nodes": [[["permute_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "keras_version": "1.2.1"}