{"keras_version": "1.2.2", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1"}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2"}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3"}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4"}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 128, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_5"}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 128, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_6"}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "upsampling2d_1", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}}, {"inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "name": "merge_1", "class_name": "Merge", "config": {"concat_axis": 1, "output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "name": "merge_1", "arguments": {}, "output_mask": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_7", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_7"}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "dropout_4", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution2d_8", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_8"}}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "upsampling2d_2", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}}, {"inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "name": "merge_2", "class_name": "Merge", "config": {"concat_axis": 1, "output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "name": "merge_2", "arguments": {}, "output_mask": null}}, {"inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_9", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_9"}}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "dropout_5", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}}, {"inbound_nodes": [[["dropout_5", 0, 0]]], "name": "convolution2d_10", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_10"}}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "convolution2d_11", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 5, "nb_col": 1, "bias": true, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_11"}}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "reshape_1", "class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [5, 1024]}}, {"inbound_nodes": [[["reshape_1", 0, 0]]], "name": "permute_1", "class_name": "Permute", "config": {"trainable": true, "dims": [2, 1], "name": "permute_1"}}, {"inbound_nodes": [[["permute_1", 0, 0]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "activation": "softplus", "name": "activation_1"}}], "name": "model_1", "output_layers": [["activation_1", 0, 0]]}, "class_name": "Model"}