{"keras_version": "1.2.1", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3, 288, 384], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 32}, "class_name": "Convolution2D"}, {"name": "dropout_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 32}, "class_name": "Convolution2D"}, {"name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64}, "class_name": "Convolution2D"}, {"name": "dropout_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"p": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"name": "convolution2d_4", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64}, "class_name": "Convolution2D"}, {"name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 128}, "class_name": "Convolution2D"}, {"name": "dropout_3", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"p": 0.2, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"name": "convolution2d_6", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_6", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 128}, "class_name": "Convolution2D"}, {"name": "upsampling2d_1", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"name": "upsampling2d_1", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D"}, {"name": "merge_1", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "config": {"mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "concat_axis": 1, "output_mask": null, "arguments": {}, "name": "merge_1", "output_shape_type": "raw", "output_shape": null, "mode": "concat"}, "class_name": "Merge"}, {"name": "convolution2d_7", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_7", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64}, "class_name": "Convolution2D"}, {"name": "dropout_4", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"p": 0.2, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"name": "convolution2d_8", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_8", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64}, "class_name": "Convolution2D"}, {"name": "upsampling2d_2", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"name": "upsampling2d_2", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D"}, {"name": "merge_2", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "config": {"mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "concat_axis": 1, "output_mask": null, "arguments": {}, "name": "merge_2", "output_shape_type": "raw", "output_shape": null, "mode": "concat"}, "class_name": "Merge"}, {"name": "convolution2d_9", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_9", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 32}, "class_name": "Convolution2D"}, {"name": "dropout_5", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"p": 0.2, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"name": "convolution2d_10", "inbound_nodes": [[["dropout_5", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_10", "nb_row": 3, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 32}, "class_name": "Convolution2D"}, {"name": "convolution2d_11", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_11", "nb_row": 1, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "th", "activation": "relu", "nb_col": 1, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 4}, "class_name": "Convolution2D"}, {"name": "reshape_1", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"name": "reshape_1", "target_shape": [4, 110592], "trainable": true}, "class_name": "Reshape"}, {"name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0]]], "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "class_name": "Permute"}, {"name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0]]], "config": {"name": "activation_1", "activation": "softplus", "trainable": true}, "class_name": "Activation"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "class_name": "Model"}