{"class_name": "Model", "keras_version": "1.2.1", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 3, 288, 384], "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_1", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_2", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"dim_ordering": "th", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_3", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_3"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_4", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"dim_ordering": "th", "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "name": "maxpooling2d_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_5", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_5"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_6", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_6"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_1"}, "name": "upsampling2d_1"}, {"class_name": "Merge", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "name": "merge_1", "mode_type": "raw", "mode": "concat", "dot_axes": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "output_mask": null}, "name": "merge_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_7", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_7"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_4"}, "name": "dropout_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_8", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_8"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_2"}, "name": "upsampling2d_2"}, {"class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "name": "merge_2", "mode_type": "raw", "mode": "concat", "dot_axes": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "output_mask": null}, "name": "merge_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_9", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_9"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_5"}, "name": "dropout_5"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_5", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_10", "nb_col": 3, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "name": "convolution2d_10"}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 4, "bias": true, "subsample": [1, 1], "trainable": true, "name": "convolution2d_11", "nb_col": 1, "activation": "relu", "W_constraint": null, "dim_ordering": "th", "b_constraint": null, "nb_row": 1, "b_regularizer": null}, "name": "convolution2d_11"}, {"class_name": "Reshape", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"target_shape": [4, 110592], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0]]], "config": {"trainable": true, "dims": [2, 1], "name": "permute_1"}, "name": "permute_1"}, {"class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0]]], "config": {"activation": "softplus", "trainable": true, "name": "activation_1"}, "name": "activation_1"}], "name": "model_1"}}