{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 3, 288, 384], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "subsample": [1, 1], "nb_filter": 32, "activation": "relu"}, "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "subsample": [1, 1], "nb_filter": 32, "activation": "relu"}, "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true}, "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_3", "subsample": [1, 1], "nb_filter": 64, "activation": "relu"}, "name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "subsample": [1, 1], "nb_filter": 64, "activation": "relu"}, "name": "convolution2d_4", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true}, "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "subsample": [1, 1], "nb_filter": 128, "activation": "relu"}, "name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "name": "dropout_3", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_6", "subsample": [1, 1], "nb_filter": 128, "activation": "relu"}, "name": "convolution2d_6", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "upsampling2d_1", "trainable": true}, "name": "upsampling2d_1", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "concat", "concat_axis": 1, "arguments": {}, "dot_axes": -1, "mode_type": "raw", "name": "merge_1", "output_mask": null, "output_shape": null, "output_shape_type": "raw", "output_mask_type": "raw"}, "name": "merge_1", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_7", "subsample": [1, 1], "nb_filter": 64, "activation": "relu"}, "name": "convolution2d_7", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "name": "dropout_4", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_8", "subsample": [1, 1], "nb_filter": 64, "activation": "relu"}, "name": "convolution2d_8", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "upsampling2d_2", "trainable": true}, "name": "upsampling2d_2", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "concat", "concat_axis": 1, "arguments": {}, "dot_axes": -1, "mode_type": "raw", "name": "merge_2", "output_mask": null, "output_shape": null, "output_shape_type": "raw", "output_mask_type": "raw"}, "name": "merge_2", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_9", "subsample": [1, 1], "nb_filter": 32, "activation": "relu"}, "name": "convolution2d_9", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "name": "dropout_5", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_10", "subsample": [1, 1], "nb_filter": 32, "activation": "relu"}, "name": "convolution2d_10", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_col": 1, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "th", "b_regularizer": null, "nb_row": 1, "name": "convolution2d_11", "subsample": [1, 1], "nb_filter": 4, "activation": "relu"}, "name": "convolution2d_11", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Reshape", "config": {"target_shape": [4, 110592], "name": "reshape_1", "trainable": true}, "name": "reshape_1", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0]]]}], "output_layers": [["activation_1", 0, 0]]}, "keras_version": "1.2.1"}