{"keras_version": "1.2.1", "config": {"output_layers": [["activation_1", 0, 0]], "name": "model_1", "layers": [{"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 3, 288, 384], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_1", "W_constraint": null, "activation": "relu", "nb_filter": 32, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_2", "W_constraint": null, "activation": "relu", "nb_filter": 32, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_3", "W_constraint": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_4", "W_constraint": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_5", "W_constraint": null, "activation": "relu", "nb_filter": 128, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_5"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_6", "W_constraint": null, "activation": "relu", "nb_filter": 128, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6"}, {"config": {"size": [2, 2], "trainable": true, "name": "upsampling2d_1"}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "upsampling2d_1"}, {"config": {"output_mask_type": "raw", "mode_type": "raw", "concat_axis": 1, "arguments": {}, "name": "merge_1", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1, "mode": "concat"}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "name": "merge_1"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_7", "W_constraint": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_7"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_8", "W_constraint": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "convolution2d_8"}, {"config": {"size": [2, 2], "trainable": true, "name": "upsampling2d_2"}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "upsampling2d_2"}, {"config": {"output_mask_type": "raw", "mode_type": "raw", "concat_axis": 1, "arguments": {}, "name": "merge_2", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1, "mode": "concat"}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "name": "merge_2"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_9", "W_constraint": null, "activation": "relu", "nb_filter": 32, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_9"}, {"config": {"b_regularizer": null, "nb_row": 3, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_10", "W_constraint": null, "activation": "relu", "nb_filter": 32, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "convolution2d_10"}, {"config": {"b_regularizer": null, "nb_row": 1, "border_mode": "same", "dim_ordering": "th", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_11", "W_constraint": null, "activation": "relu", "nb_filter": 6, "nb_col": 1, "activity_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "convolution2d_11"}, {"config": {"trainable": true, "target_shape": [6, 110592], "name": "reshape_1"}, "class_name": "Reshape", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "reshape_1"}, {"config": {"trainable": true, "dims": [2, 1], "name": "permute_1"}, "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0]]], "name": "permute_1"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}