{"keras_version": "1.2.1", "config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 3, 288, 384]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "convolution2d_1", "config": {"name": "convolution2d_1", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "config": {"name": "convolution2d_2", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "maxpooling2d_1", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "config": {"name": "convolution2d_3", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "convolution2d_4", "config": {"name": "convolution2d_4", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "maxpooling2d_2", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "config": {"name": "convolution2d_5", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 128, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "convolution2d_6", "config": {"name": "convolution2d_6", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 128, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "upsampling2d_1", "config": {"size": [2, 2], "name": "upsampling2d_1", "trainable": true}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "merge_1", "config": {"name": "merge_1", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw", "dot_axes": -1, "mode": "concat", "mode_type": "raw", "output_shape": null, "output_mask": null, "arguments": {}}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_7", "config": {"name": "convolution2d_7", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "convolution2d_8", "config": {"name": "convolution2d_8", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "upsampling2d_2", "config": {"size": [2, 2], "name": "upsampling2d_2", "trainable": true}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "merge_2", "config": {"name": "merge_2", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw", "dot_axes": -1, "mode": "concat", "mode_type": "raw", "output_shape": null, "output_mask": null, "arguments": {}}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_9", "config": {"name": "convolution2d_9", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_10", "config": {"name": "convolution2d_10", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "convolution2d_11", "config": {"name": "convolution2d_11", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "nb_filter": 4, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "bias": true, "nb_col": 1, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "nb_row": 1}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [4, 110592]}, "class_name": "Reshape", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "permute_1", "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}, "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "softplus", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0]]]}], "output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}