{"keras_version": "1.2.2", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 32, 32], "input_dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 32, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 32, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 128, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 128, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_6", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "upsampling2d_1", "class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "upsampling2d_1", "trainable": true}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"concat_axis": 1, "dot_axes": -1, "name": "merge_1", "mode": "concat", "mode_type": "raw", "output_shape": null, "arguments": {}, "output_mask": null, "output_mask_type": "raw", "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_7", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_8", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "upsampling2d_2", "class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "upsampling2d_2", "trainable": true}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"concat_axis": 1, "dot_axes": -1, "name": "merge_2", "mode": "concat", "mode_type": "raw", "output_shape": null, "arguments": {}, "output_mask": null, "output_mask_type": "raw", "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_9", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 32, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_9", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.2}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_10", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 3, "nb_filter": 32, "subsample": [1, 1], "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_10", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "convolution2d_11", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_col": 1, "nb_filter": 4, "subsample": [1, 1], "nb_row": 1, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_11", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [4, 1024], "name": "reshape_1", "trainable": true}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "permute_1", "class_name": "Permute", "config": {"dims": [2, 1], "name": "permute_1", "trainable": true}, "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"activation": "softplus", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["permute_1", 0, 0]]]}]}}