{"keras_version": "1.2.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "gaussiannoise_1", "class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussiannoise_1", "sigma": 0.3}}, {"inbound_nodes": [[["gaussiannoise_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "upsampling2d_1", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}}, {"inbound_nodes": [[["upsampling2d_1", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_3", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 16, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 16, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_6", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_7", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_7", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_4"}}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution2d_8", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_8", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "convolution2d_9", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_9", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 128, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "dropout_5", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_5"}}, {"inbound_nodes": [[["dropout_5", 0, 0]]], "name": "convolution2d_10", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_10", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 128, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "upsampling2d_2", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}}, {"inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_8", 0, 0]]], "name": "merge_1", "class_name": "Merge", "config": {"mode": "concat", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "concat_axis": 1, "arguments": {}, "mode_type": "raw", "output_mask_type": "raw", "name": "merge_1", "output_mask": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_11", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_11", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "dropout_6", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_6"}}, {"inbound_nodes": [[["dropout_6", 0, 0]]], "name": "convolution2d_12", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_12", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "upsampling2d_3", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}}, {"inbound_nodes": [[["upsampling2d_3", 0, 0], ["convolution2d_6", 0, 0]]], "name": "merge_2", "class_name": "Merge", "config": {"mode": "concat", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "concat_axis": 1, "arguments": {}, "mode_type": "raw", "output_mask_type": "raw", "name": "merge_2", "output_mask": null}}, {"inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_13", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_13", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "dropout_7", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_7"}}, {"inbound_nodes": [[["dropout_7", 0, 0]]], "name": "convolution2d_14", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_14", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "upsampling2d_4", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}}, {"inbound_nodes": [[["upsampling2d_4", 0, 0], ["convolution2d_4", 0, 0]]], "name": "merge_3", "class_name": "Merge", "config": {"mode": "concat", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "concat_axis": 1, "arguments": {}, "mode_type": "raw", "output_mask_type": "raw", "name": "merge_3", "output_mask": null}}, {"inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution2d_15", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_15", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 16, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "dropout_8", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_8"}}, {"inbound_nodes": [[["dropout_8", 0, 0]]], "name": "convolution2d_16", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_16", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 16, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "maxpooling2d_4", "class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_4", "border_mode": "valid"}}, {"inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "convolution2d_17", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_17", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_17", 0, 0]]], "name": "dropout_9", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_9"}}, {"inbound_nodes": [[["dropout_9", 0, 0]]], "name": "convolution2d_18", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_18", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "convolution2d_19", "class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "activation": "relu", "b_constraint": null, "b_regularizer": null, "nb_row": 1, "name": "convolution2d_19", "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 6, "trainable": true, "bias": true, "W_constraint": null, "nb_col": 1, "border_mode": "same", "init": "glorot_uniform"}}, {"inbound_nodes": [[["convolution2d_19", 0, 0]]], "name": "reshape_1", "class_name": "Reshape", "config": {"trainable": true, "target_shape": [6, 1024], "name": "reshape_1"}}, {"inbound_nodes": [[["reshape_1", 0, 0]]], "name": "permute_1", "class_name": "Permute", "config": {"trainable": true, "name": "permute_1", "dims": [2, 1]}}, {"inbound_nodes": [[["permute_1", 0, 0]]], "name": "activation_1", "class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "name": "model_1", "output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}}