{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 1, 32, 32]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "GaussianNoise", "config": {"sigma": 0.3, "name": "gaussiannoise_1", "trainable": true}, "name": "gaussiannoise_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_1", "W_regularizer": null}, "name": "convolution2d_1", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "name": "dropout_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_2", "W_regularizer": null}, "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_1", "size": [2, 2], "trainable": true}, "name": "upsampling2d_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_3", "W_regularizer": null}, "name": "convolution2d_3", "inbound_nodes": [[["upsampling2d_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "name": "dropout_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_4", "W_regularizer": null}, "name": "convolution2d_4", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_5", "W_regularizer": null}, "name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "name": "dropout_3", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_6", "W_regularizer": null}, "name": "convolution2d_6", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_7", "W_regularizer": null}, "name": "convolution2d_7", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}, "name": "dropout_4", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_8", "W_regularizer": null}, "name": "convolution2d_8", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_9", "W_regularizer": null}, "name": "convolution2d_9", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.2}, "name": "dropout_5", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_10", "W_regularizer": null}, "name": "convolution2d_10", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_2", "size": [2, 2], "trainable": true}, "name": "upsampling2d_2", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Merge", "config": {"output_mask": null, "mode_type": "raw", "concat_axis": 1, "mode": "concat", "output_mask_type": "raw", "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "name": "merge_1"}, "name": "merge_1", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_8", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_11", "W_regularizer": null}, "name": "convolution2d_11", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.2}, "name": "dropout_6", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_12", "W_regularizer": null}, "name": "convolution2d_12", "inbound_nodes": [[["dropout_6", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_3", "size": [2, 2], "trainable": true}, "name": "upsampling2d_3", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Merge", "config": {"output_mask": null, "mode_type": "raw", "concat_axis": 1, "mode": "concat", "output_mask_type": "raw", "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "name": "merge_2"}, "name": "merge_2", "inbound_nodes": [[["upsampling2d_3", 0, 0], ["convolution2d_6", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_13", "W_regularizer": null}, "name": "convolution2d_13", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.2}, "name": "dropout_7", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_14", "W_regularizer": null}, "name": "convolution2d_14", "inbound_nodes": [[["dropout_7", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_4", "size": [2, 2], "trainable": true}, "name": "upsampling2d_4", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "Merge", "config": {"output_mask": null, "mode_type": "raw", "concat_axis": 1, "mode": "concat", "output_mask_type": "raw", "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "name": "merge_3"}, "name": "merge_3", "inbound_nodes": [[["upsampling2d_4", 0, 0], ["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_15", "W_regularizer": null}, "name": "convolution2d_15", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.2}, "name": "dropout_8", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_16", "W_regularizer": null}, "name": "convolution2d_16", "inbound_nodes": [[["dropout_8", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_4", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_17", "W_regularizer": null}, "name": "convolution2d_17", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "p": 0.2}, "name": "dropout_9", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "relu", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_18", "W_regularizer": null}, "name": "convolution2d_18", "inbound_nodes": [[["dropout_9", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 6, "activation": "relu", "nb_col": 1, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "init": "glorot_uniform", "dim_ordering": "th", "trainable": true, "b_constraint": null, "border_mode": "same", "name": "convolution2d_19", "W_regularizer": null}, "name": "convolution2d_19", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [6, 1024]}, "name": "reshape_1", "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["permute_1", 0, 0]]]}]}, "keras_version": "1.2.2"}