{"keras_version": "1.2.2", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "input_1", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "name": "input_1", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "gaussiannoise_1", "config": {"trainable": true, "sigma": 0.3, "name": "gaussiannoise_1"}, "class_name": "GaussianNoise", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_1", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]]}, {"name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "upsampling2d_1", "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_1"}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 16, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_1", 0, 0]]]}, {"name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "convolution2d_4", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 16, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "maxpooling2d_1", "config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "convolution2d_6", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_6", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "maxpooling2d_2", "config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "convolution2d_7", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_7", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "convolution2d_8", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_8", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "maxpooling2d_3", "config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "convolution2d_9", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_9", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 128, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_10", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_10", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 128, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "upsampling2d_2", "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_2"}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "merge_1", "config": {"output_mask": null, "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "output_shape": null, "arguments": {}, "mode": "concat"}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_8", 0, 0]]]}, {"name": "convolution2d_11", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_11", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "convolution2d_12", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_12", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_6", 0, 0]]]}, {"name": "upsampling2d_3", "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_3"}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"name": "merge_2", "config": {"output_mask": null, "name": "merge_2", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "output_shape": null, "arguments": {}, "mode": "concat"}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_3", 0, 0], ["convolution2d_6", 0, 0]]]}, {"name": "convolution2d_13", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_13", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"name": "convolution2d_14", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_14", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_7", 0, 0]]]}, {"name": "upsampling2d_4", "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_4"}, "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"name": "merge_3", "config": {"output_mask": null, "name": "merge_3", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "output_shape": null, "arguments": {}, "mode": "concat"}, "class_name": "Merge", "inbound_nodes": [[["upsampling2d_4", 0, 0], ["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_15", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_15", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 16, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "dropout_8", "config": {"trainable": true, "name": "dropout_8", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"name": "convolution2d_16", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_16", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 16, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_8", 0, 0]]]}, {"name": "maxpooling2d_4", "config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"name": "convolution2d_17", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_17", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"name": "dropout_9", "config": {"trainable": true, "name": "dropout_9", "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"name": "convolution2d_18", "config": {"trainable": true, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_18", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D", "inbound_nodes": [[["dropout_9", 0, 0]]]}, {"name": "convolution2d_19", "config": {"trainable": true, "nb_row": 1, "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_19", "init": "glorot_uniform", "dim_ordering": "th", "b_constraint": null, "nb_filter": 6, "W_constraint": null, "activation": "relu", "nb_col": 1}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [6, 1024]}, "class_name": "Reshape", "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"name": "permute_1", "config": {"trainable": true, "name": "permute_1", "dims": [2, 1]}, "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0]]]}]}, "class_name": "Model"}