{"keras_version": "1.2.2", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 1, 32, 32], "sparse": false}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_1", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_2", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid"}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_3", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_4", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid"}}, {"name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_5", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_6", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "upsampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"name": "upsampling2d_1", "trainable": true, "size": [2, 2]}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_4", 0, 0]]], "config": {"output_mask_type": "raw", "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null, "output_mask": null, "concat_axis": 1, "mode": "concat", "mode_type": "raw"}}, {"name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_7", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"name": "dropout_4", "trainable": true, "p": 0.2}}, {"name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_8", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "upsampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"name": "upsampling2d_2", "trainable": true, "size": [2, 2]}}, {"name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_2", 0, 0]]], "config": {"output_mask_type": "raw", "name": "merge_2", "output_shape_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null, "output_mask": null, "concat_axis": 1, "mode": "concat", "mode_type": "raw"}}, {"name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_9", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"name": "dropout_5", "trainable": true, "p": 0.2}}, {"name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_5", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "border_mode": "same", "nb_row": 3, "W_constraint": null, "name": "convolution2d_10", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "convolution2d_11", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"trainable": true, "W_regularizer": null, "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 6, "border_mode": "same", "nb_row": 1, "W_constraint": null, "name": "convolution2d_11", "bias": true, "dim_ordering": "th", "b_constraint": null, "activation": "relu", "b_regularizer": null}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"name": "reshape_1", "trainable": true, "target_shape": [6, 1024]}}, {"name": "permute_1", "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0]]], "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0]]], "config": {"name": "activation_1", "trainable": true, "activation": "softplus"}}]}}